---
type: ConceptualSurfaceType
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 6
tags: [revit-api, class]
---

# ConceptualSurfaceType

`Autodesk.Revit.DB.Analysis.ConceptualSurfaceType` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAllMassSubCategoryIds | 2012 | `public static IList < ElementId > GetAllMassSubCategoryIds ()` |
| Method | GetByMassSubCategoryId | 2012 | `public static ConceptualSurfaceType GetByMassSubCategoryId ( Document cda , ElementId massSubCategoryId )` |
| Method | GetConstructionTypeIds | 2012 | `public ICollection < ElementId > GetConstructionTypeIds ()` |
| Property | DefaultConstructionTypeId | 2012 | `public ElementId DefaultConstructionTypeId { get ; set ; }` |
| Property | MassSubCategoryId | 2012 | `public ElementId MassSubCategoryId { get ; }` |
| Property | Parameter | — | `` |